FutureDesigns/uEZ/uEZ/Source/Devices/USBDevice/NXP/LPC2478/lpc2478_USBDevice.c
/*-------------------------------------------------------------------------*
 * Function:  NXP_USBDevice_RegisterRequestTypeCallback
 *-------------------------------------------------------------------------*
 * Description:
 *      Register a handler for different types of control 0 requests.
 * Inputs:
 *      void *aWorkspace        -- USB Device's workspace
 *      TUInt8 aType            -- Type of control 0 request.  Can be
 *                                  USB_REQUEST_TYPE_STANDARD,
 *                                  USB_REQUEST_TYPE_CLASS,
 *                                  USB_REQUEST_TYPE_VENDOR, or
 *                                  USB_REQUEST_TYPE_RESERVED
 *      void *aBuffer           -- Buffer to receive data (up to endpoint
 *                                  max sized packet).
 *      void *aCallbackWorkspace -- Pointer to callback's workspace
 *      T_USBRrequestHandlerFunc aRequestHandler -- Function called when
 *                                  control endpoint 0 receives data
 *                                  of this type.
 * Outputs:
 *      T_uezError              -- Returns UEZ_ERROR_NONE if successfully
 *                                  registered.  Returns
 *                                  UEZ_ERROR_NOT_AVAILABLE if slot already
 *                                  registered.  Returns
 *                                  UEZ_ERROR_ILLEGAL_OPERATION if incorrect
 *                                  type.
 *-------------------------------------------------------------------------*/
static T_uezError NXP_USBDevice_RegisterRequestTypeCallback(
            void *aWorkspace,
            TUInt8 aType,
            void *aBuffer,
            void *aCallbackWorkspace,
            T_USBRequestHandlerFunc aRequestHandler)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_USBDevice_NXP_2478_Workspace *p =
        (T_USBDevice_NXP_2478_Workspace *)aWorkspace;
    T_USBDeviceRequestTypeHandlerStruct *p_handler;

    // Modify the callback table while no callbacks can occur
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    if (aType <= USB_REQUEST_TYPE_RESERVED) {
        p_handler = &p->iUSBDevice.iRequestTypeHandlers[aType];
        if ((p_handler->iHandler == 0) ||
                ((p_handler->iHandler == NXP_USBDevice_StandardDeviceRequest) &&
                    (aType == USB_REQUEST_TYPE_STANDARD)))  {
            p_handler->iHandler = aRequestHandler;
            p_handler->iBuffer = aBuffer;
            p_handler->iWorkspace = aCallbackWorkspace;
        } else {
            error = UEZ_ERROR_NOT_AVAILABLE;
        }
    } else {
        error = UEZ_ERROR_ILLEGAL_OPERATION;
    }

    UEZSemaphoreRelease(p->iSem);
    return error;
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_USBDevice_UnregisterRequestTypeCallback
 *-------------------------------------------------------------------------*
 * Description:
 *      Register a handler for different types of control 0 requests.
 * Inputs:
 *      void *aWorkspace        -- USB Device's workspace
 *      TUInt8 aType            -- Type of control 0 request.  Can be
 *                                  USB_REQUEST_TYPE_STANDARD,
 *                                  USB_REQUEST_TYPE_CLASS,
 *                                  USB_REQUEST_TYPE_VENDOR, or
 *                                  USB_REQUEST_TYPE_RESERVED
 * Outputs:
 *      T_uezError              -- Returns UEZ_ERROR_NONE if successfully
 *                                  unregistered.  Returns
 *                                  UEZ_ERROR_NOT_FOUND if slot already
 *                                  unregistered.  Returns
 *                                  UEZ_ERROR_ILLEGAL_OPERATION if incorrect
 *                                  type.
 *-------------------------------------------------------------------------*/
static T_uezError NXP_USBDevice_UnregisterRequestTypeCallback(
            void *aWorkspace,
            TUInt8 aType)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_USBDevice_NXP_2478_Workspace *p =
        (T_USBDevice_NXP_2478_Workspace *)aWorkspace;
    T_USBDeviceRequestTypeHandlerStruct *p_handler;

    // Modify the callback table while no callbacks can occur
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    if (aType <= USB_REQUEST_TYPE_RESERVED) {
        p_handler = &p->iUSBDevice.iRequestTypeHandlers[aType];
        if ((p_handler->iHandler == 0) ||
                ((p_handler->iHandler == NXP_USBDevice_StandardDeviceRequest) &&
                    (aType == USB_REQUEST_TYPE_STANDARD)))  {
            // Already unregistered
            error = UEZ_ERROR_NOT_FOUND;
        } else {
            // Unregister the function
            if (aType == USB_REQUEST_TYPE_STANDARD)
                p_handler->iHandler = NXP_USBDevice_StandardDeviceRequest;
            else
                p_handler->iHandler = 0;
            p_handler->iBuffer = 0;
            p_handler->iWorkspace = 0;
        }
    } else {
        error = UEZ_ERROR_ILLEGAL_OPERATION;
    }

    UEZSemaphoreRelease(p->iSem);
    return error;
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_USBDevice_InterruptNakEnable
 *-------------------------------------------------------------------------*
 * Description:
 *      Declare which type of Naks generate interrupts.
 * Inputs:
 *      T_LPC2478_USBDev_Workspace *p -- workspace
 *      TUInt8 aNakBits             -- Nak bits
 *-------------------------------------------------------------------------*/
static void NXP_USBDevice_InterruptNakEnable(
                void *aWorkspace,
                TUInt8 aNakBits)
{
    T_USBDevice_NXP_2478_Workspace *p =
        (T_USBDevice_NXP_2478_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->InterruptNakEnable(
            p->iUSBDeviceController,
            aNakBits);
    UEZSemaphoreRelease(p->iSem);
}

void USBDevice_LPC2478_Create(const char *aName, const char *aHALName)
{
    T_USBDevice_NXP_2478_Workspace *p;

    // Register USBDevice (which links it to the USBDeviceController)
    UEZDeviceTableRegister(
            aName,
            (T_uezDeviceInterface *)&USBDevice_NXP_LPC2478_Interface,
            0,
            (T_uezDeviceWorkspace **)&p);

    // Access the USBDevice HAL and link to this device
    HALInterfaceFind(
            aHALName,
            (T_halWorkspace **)&p->iUSBDeviceController);
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const DEVICE_USB_DEVICE USBDevice_NXP_LPC2478_Interface = {
	{
	    // Common device interface
	    "USBDevice:NXP:LPC2478",
	    0x0100,
	    USBDevice_NXP_InitializeWorkspace_USBDevice,
	    sizeof(T_USBDevice_NXP_2478_Workspace),
	},
	
    // Functions
    NXP_USBDevice_Configure,
    NXP_USBDevice_Initialize,
    NXP_USBDevice_Connect,
    NXP_USBDevice_Disconnect,
    NXP_USBDevice_SetAddress,
    NXP_USBDevice_EndpointConfigure,
    NXP_USBDevice_Read,
    NXP_USBDevice_Write,
    NXP_USBDevice_SetStallState,
    NXP_USBDevice_IsStalled,
    NXP_USBDevice_EndpointInterruptsEnable,
    NXP_USBDevice_EndpointInterruptsDisable,
    NXP_USBDevice_ForceAddressAndConfiguration,
    NXP_USBDevice_RegisterEndpointCallback,
    NXP_USBDevice_UnregisterEndpointCallback,
    NXP_USBDevice_RegisterRequestTypeCallback,
    NXP_USBDevice_UnregisterRequestTypeCallback,
    NXP_USBDevice_ProcessEndpoints,
    NXP_USBDevice_InterruptNakEnable,
} ;

/*-------------------------------------------------------------------------*
 * End of File:  lpc2478_USBDevice.c
 *-------------------------------------------------------------------------*/
